package com.hongguo.read.mvp.model.vip;

import java.util.List;

public class VipBean {
    /**
     * pager : {"total":50,"page":1,"size":20}
     * data : [{"serial":1,"id":200471,"name":"恶少的贴身女佣","author":"夜雨青竹","cover":"http://i-1.hgread.com/2017/8/10/bc5c7951-a3ae-4661-817a-d34ccc693965.jpg","summary":"为了逃脱家族联姻，她离家出走，却被拐卖到山村里，她逃走，又被抓回，无意间成为恶少的贴身女佣。他邪恶、过分、欠扁，还喜欢嘿嘿嘿~被出卖、被利用、被压迫、被掠夺，还要跟她抢宝宝！别以为装作不认识本姑娘，本姑娘就能饶了你！！！"},{"serial":2,"id":200495,"name":"女配是只狐狸精","author":"明雅","cover":"http://i-1.hgread.com/2017/8/10/18308838-2d40-426d-95e9-ec8cb7d5a453.jpg","summary":"女配就是给女主服务的。凭什么！紫欢掀桌了。接受了花妖委托，要救回心爱之人的小狐狸，进入三千世界，只为找一人的魂魄转世。高冷学长？好的。初恋情人？好的。邪魅帝王？好的。\u2026\u2026只要是他，紫欢统统不会放过。"},{"serial":3,"id":200516,"name":"邪魔夫君捡回家","author":"惜羽沫","cover":"http://i-1.hgread.com/2017/8/10/1e664805-6109-47ca-a6a3-781aa8543f3e.jpg","summary":"我是落魄的神族，无意中捡了个漂亮盒子回来，等到发现这盒子的妙用时，才知道我特么压根是捡了个男人回来！我一路逃，他一路追，就在我无路可逃时，欲哭无泪的看着他，爷，你放过小女子行不行？奈何某人慵懒的说：\u201c今生今世，生生世世，我都不会放开你......\u201d要是有什么想对沫沫说的可以留言给我，我看到后一定会第一时间回复的。谢谢大家啦！总之多推荐！多收藏就是沫沫写文的动力！打赏满1000就加一更，依此类推！"},{"serial":4,"id":200525,"name":"嫡女凰途：废后要爬墙","author":"日往烟萝","cover":"http://i-1.hgread.com/2017/8/10/00207dbc-3583-4528-8051-5c1eb5caca08.jpg","summary":"世人皆道，她是最最狠毒之女子，弑君杀夫，翻覆皇权。所幸苍天有眼，让她死在至亲手里，万箭穿心。世人皆道，她是最最懦弱之女子，空守中宫六年，一朝流落尼寺，还要被小三暗算，孤苦死去。当她变成她，翻手云，覆手雨，偷天换日。誓要世间辱她、欺她、负她者，不得好死！皇帝前夫回头？对不起不稀罕。公侯世子青眼？不好意思跟你很熟吗。至于这只前世的冤家\u2026\u2026冯蓁忍无可忍：\u201c这位兄台，我们已经和离了，能别缠着我么！\u201d--------------------------------------------------穿越重生男强女强一对一身心干净，请放心食用~"},{"serial":5,"id":200522,"name":"狗仔甜妻：暮少，别乱撩","author":"琴酒先生","cover":"http://i-1.hgread.com/2017/8/10/731058d7-d366-46fa-883e-e2b711e87e47.jpg","summary":"无意穿成为别人，以他人的身份与他相爱。为了让他喜欢上完整的自己，为了让他完全摆脱过去的人，她在他面前死去，给他留下了深深的伤痛。严茉再次醒来，如愿以偿的回到自己的身体里，对着已经满心创伤的暮景，除了心疼还有抱歉。这次，她要真正的与他在一起，没有别人的参与，身与心，都是她自己的。严茉下了豪言壮语，她要再次让他喜欢上自己！但是，他已不是那个他，虽然依旧绅士风度翩翩，只是不想再对谁动心。没关系，死缠烂打，做他助理做他邻居\u2026\u2026好像没用，他无动于衷。好吧，那她只能不择手段，追他追到床上去，看他怎么拒绝！\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026\u2026新书已开《将门逃妻：郡王别追了》是狗仔妻里的段艺的故事，请大家多多支持！谢谢大家！"},{"serial":6,"id":200504,"name":"试爱成婚：甜心再结难逃","author":"叁娘煮面","cover":"http://i-1.hgread.com/2017/8/10/5e890967-aa9f-44b9-abac-6f00a712d63d.jpg","summary":"\u201c妈咪，我从石头里蹦出来已有三年，现在可以聊聊那个抛弃你的渣男了吧！\u201d什么！她才不是被抛弃的那个！\u201c瞎说！爸爸很爱妈妈，只是妈妈比较不幸，年纪轻轻丧了偶。\u201d\u201c咦？可是那边有个很拽的男人自称我爸爸，莫非鬼上身？\u201d死女人，带着儿子跑了不说竟敢诅咒他！那就别怪他今晚要上演一出鬼压床\u2026\u2026"},{"serial":7,"id":200510,"name":"睡服鲜妻：这个男主太禽兽","author":"木夕","cover":"http://i-1.hgread.com/2017/8/10/d3e412df-bddf-43ec-8861-35074cce8895.jpg","summary":"&quot;某日，叶凡柔莫名穿越了。别人穿越不是千金小姐，就是公主郡主什么的。她穿越，却穿到了一本坑爹的无比的HH虐文小说中的坑爹女主。什么叫虐文？那就是\u201c他人虐我千百遍，我待他人如初恋\u201d。嘤嘤，这么高的觉悟，臣妾做不到啊！什么叫HH文？【哔~~】作为文中的第一女主，被虐得死去活来，没想到最后的结果，居然被无情的抛弃了！！！面对如此坑爹的命运，叶凡柔秉承着\u201c死道友，不死贫道\u201d的原则。果断，逃\u2026\u2026爱谁当坑爹女主，谁当去！只是，男主大人，你拉着我干嘛？！！不想被你虐，不想被你潜，求放过~~&quot;"},{"serial":8,"id":200519,"name":"总裁住对门：不撩自来","author":"请给我你的大腿肉","cover":"http://i-1.hgread.com/2017/8/10/f8ff5c14-7c25-4eff-ac36-492c1f0e2357.jpg","summary":"被男友和闺蜜双双背叛，甚至还被安上了\u201c国民小三\u201d的称号，那叫一个酸爽！不过高冷如秦安，从没想过要去报复。偶然邂逅奇郁集团总裁，他的实力吊打前男友，并能轻易帮她摆脱不实的传闻。不过高冷如秦安，没有这么去做。秦安：\u201c等等！我没去撩你，你还主动贴上来了？好歹你也是个总裁，学我一样高冷一点啊喂！\u201d郁琮：\u201c高冷是什么？是跟你一样，可以吃的吗？\u201d【每累积打赏10000米粒，加更一章】"},{"serial":9,"id":200501,"name":"炮灰女配的作死日常","author":"大风抽兮","cover":"http://i-1.hgread.com/2017/8/10/f6ddf48d-b9b6-42fc-9797-b6c0ea023fd9.jpg","summary":"本以为这辈子是玩到头了，没想竟然穿越到古代宫斗小说里。身份是烂大街的相府嫡女。爹爹是宠妾灭妻的渣男。后娘是两面三刀的毒妇。妹妹是纯洁如雪的白莲花。就连未婚夫太子殿下也很喜闻乐见的爱上了她的妹妹。沈念初嘴角抽了抽，手动点了个赞，可以，这很套路。（特种兵女汉纸炮灰逆袭之路，作死小达人撕逼日常）（不在撕逼就在去撕逼的路上）"},{"serial":10,"id":200456,"name":"悍女逆袭：狂妃有点毒","author":"月泪儿","cover":"http://i-1.hgread.com/2017/8/10/5c8c5ecb-95a8-4919-a862-d56337efdb28.jpg","summary":"夫君弃她！继母害她！姐妹欺她！心善换来的是众人的唾弃与背叛！夫君与姐姐狼狈为奸将活活掐死了她的孩子，善心最后不能善终！重生后的她誓要报这血海深仇！斗姨娘，断亲情，戏姐妹，与皇后为敌，身边处处充满着危机，她以为她不会再遇见一个对她好的人，不会再去爱，可情到深处，怎能自拔\u2026\u2026"},{"serial":11,"id":200498,"name":"傲娇小毒妃：鬼王，快躺好！","author":"苏小梨","cover":"http://i-1.hgread.com/2017/8/10/b8973a92-4094-4ed9-b25f-64193e7b8e38.jpg","summary":"她，兰雪沁，三大古武世家兰家娇宠的大小姐，竟然穿越成一个又聋又哑又痴傻的庶女？祖传异宝显神功，得绝世功法，九卷丹书，从此通晓毒医，修炼绝世功法，炼丹，炼阵，制符，驯兽，全都不在话下！渣妹欺凌，伪善嫡母迫害，打爆渣妹嫡母，打的她们跪地求饶！他，被迫害的皇子，潜藏在兰家的鬼面\u201c亲哥哥\u201d被她视为除了同母的亲哥哥之外最信任之人。\u201c我能治好你脸上的伤。\u201d\u201c哦？如果沁儿能治好哥哥的伤，哥哥以身相许如何？\u201d\u2026\u2026畜生，我把你当亲哥哥，你居然想睡我！"},{"serial":12,"id":200492,"name":"妃常穿越：太子的嚣张萌妻","author":"思宇","cover":"http://i-1.hgread.com/2017/8/10/a4b84fd1-1535-4c78-a20f-52e6140ba871.jpg","summary":"穿越了不要紧，穿越到了大清也没关系。但是，你总该让我在大清熟悉熟悉吧，哪有当天穿来就成亲洞房的啊？！嫁人吧也没关系，嫁到了皇家也没关系。但是，为毛别人嫁的都是四阿哥，十三阿哥，八阿哥的，我却要嫁给皇家有名的炮灰呢？！即然嫁了，就要认命，跟着太子殿下一起努力，争取不让那些如狼似虎的兄弟们给吃了！只不过，为毛大清唯一的太子殿下表现得如此的怪异呢？呜呜，看着好害怕，一点也不像别的清穿小说里面写的那样好色嚣张，简直就是一个绝世好男人啊！呃\u2026\u2026只不过有点不着调儿\u2026\u2026"},{"serial":13,"id":200507,"name":"萌宠当道：主人，请用餐！","author":"咸鱼翻身","cover":"http://i-1.hgread.com/2017/8/10/4b35d4f7-c305-4858-bb18-fd28d43b4a71.jpg","summary":"&quot;精心谋划的穿越，竟然穿成了一只\u2026\u2026吱吱鼠？好吧！为了眼前的美男，我认了！可是，这小圆球的身体怎么破？为了成为身轻、腿长、易推倒的软妹子，我决定：修仙！对了！这就是一只吱吱鼠泡美男的修仙奋斗史！&quot;"},{"serial":14,"id":200396,"name":"邪王盛宠：嚣张王妃抵万金","author":"白浅浅","cover":"http://i-1.hgread.com/2017/8/10/d3043851-bc94-48f8-aa2e-8ebb468a1c8b.jpg","summary":"前世她是站在世界巅峰的黑道之王，冷血无情的绝命杀手，今生她是大学士府痴傻嫡女，毫无战魂，还被亲姐妹虐杀，废材又如何，既然重生，她就决不放弃，势必活出自己的精彩！*\u201c武器足够快的刺入心脏，是不会流血的，也不会那么快就死掉，你会慢慢的感受你的贱命是怎么一点一点的流逝掉的。\u201d他眸光冷漠，目睹她轻轻松松干掉想要杀害她的人，面对她的冷眼，他轻描淡写：\u201c女子的发簪是用来妆点美丽的，不是用来杀人的！\u201d*他冷酷无情，绝情弃爱，却在见到她的惊才绝艳后愿逆天改命，保她性命！她的冷漠似万年寒冰，却愿意为他生死不负，红尘、地狱至死不渝！"},{"serial":15,"id":200459,"name":"总裁驾到：调教呆萌小娇妻","author":"草珊瑚含片","cover":"http://i-1.hgread.com/2017/8/10/9b29855e-237c-4e6f-b796-73bd0a17cfa5.jpg","summary":"杜萌萌说，她这辈子最后悔的一件事便是和柏子赢签什么交往协议。说好了是假装的，白纸黑字签的明明是三个月，可他娘的，怎么变成了三十六个月！这还不算什么，最最可恨的是他死不承认他有\u201c精神病\u201d！\u201c亲爱的甜心，吃药了\u2026\u2026\u201d某女张开手，掌心一粒小药片。\u201c你吃吧，别客气。\u201d\u201c我又没病！\u201d\u201c避孕药，男的吃管用吗？\u201d柏子赢说，他这辈子最开心的一件事，便是阴差阳错的找了杜萌萌做协议女友，因为\u2026\u2026这妞蠢的可以随便搓圆揉扁。"},{"serial":16,"id":200483,"name":"亿万天后心尖宠","author":"纳兰安心","cover":"http://i-1.hgread.com/2017/8/10/7e8e2d2a-c635-4084-9537-cd0692826d3f.jpg","summary":"一夜之间，她从高高在上的大小姐变为遭人排挤暗算的落魄千金。然而等她的还有更大的陷阱，陷入水火不能自拔。他救她于危难，却也对她嗤之以鼻。当她摇身一变，成为万众瞩目的性感天后他才惊觉，原来他厌恶的她，有着那么多令人生怜生爱的美好\u2026\u2026她感念他在娱乐圈对她的护庇，可当那个艳绝天下的女人回来之时，她才惊悟，原来他的娱乐帝国，是为她人而建。群号：276037157感兴趣的亲们可以进来聊聊，欢迎~"},{"serial":17,"id":200447,"name":"假如我们再相遇","author":"言曦","cover":"http://i-1.hgread.com/2017/8/10/28f3774d-3a60-472d-ba86-01f5104cab6f.jpg","summary":"大一，苏式薇暗恋陈晓智，陈晓智却没有丝毫表示；大二，陈晓智终于有所表示，却是对她避而远之；大三，兽医站的朝夕相处让两个人感情升温，但是谁都没有开口捅破；大四，陈晓智请全班同学吃饭，苏式薇没去，机场送行，苏式薇也没去。两年后，苏式薇到陈晓智的家乡开会，重新相遇的两个人能否穿越千山万水，只为对彼此的一往情深。"},{"serial":18,"id":200462,"name":"V5霸气：公主驯夫有道","author":"阿婼","cover":"http://i-1.hgread.com/2017/8/10/e473353f-ce06-4d21-8910-343b5cc66317.jpg","summary":"二丫天生的倒霉蛋儿，不但人丑肤黑被渣男甩，还必踩狗屎生意赔，做啥败啥，可谓矮矬穷中的优秀楷模。天啦撸！上辈子做了什么孽，要这样收拾老娘？老天说，看你这么背，送你一根金手指！于是乎&#183;&#183;&#183;&#183;&#183;&#183;容颜变，美如仙，踹渣男，平妖言，无耻贱人滚一边，披荆斩棘斗皇权，康庄大道任我走，钱财美男乐无边！"},{"serial":19,"id":200474,"name":"邪后涅槃：冷帝宠后成瘾","author":"喵呜","cover":"http://i-1.hgread.com/2017/8/10/5a5633eb-4bbd-4dac-8af9-b59b7c9ed339.jpg","summary":"&quot;她是郡侯掌中宝，绝色倾城的嫡女柳盈绾，她是郡侯盘中棋，清秀赢弱的庶女柳君兰，前世棋子翻身，嫁帝王，升妃位，享权势，人生赢家；嫡女失身，嫁人臣，贬妻位，遭虐待，身心皆亡。这世嫡女怨念中涅槃，再次归来，姐妹相对，仇敌相向，庶妹布局，嫡姐拆招，你我往来，到底是谁算计了谁？帝王之情、杀手之爱、权臣之心，她冷眼弃之，却用情做局将其利用，精心算计之后又是谁暖了她冰冷的心\u2026\u2026当傲娇嫡姐知道隐忍，知道隐藏情感利用情感，化身无常鬼，庶妹伪善，继母恶毒，小三狠辣，阎王不收的命，她来收！她语笑嫣然，绝色倾城，华服翩然间腥风血雨。她是从地狱归来的恶魔，势必要害她之人血债血偿！?&quot;"},{"serial":20,"id":200453,"name":"鬼夫大叔，我不约","author":"晴雪","cover":"http://i-1.hgread.com/2017/8/10/3eaae008-0661-4632-bfea-abd67ebffb17.jpg","summary":"情人节抢红包，结果抢来一只鬼夫，从此，我身边怪事不断，老家的村子凭空消失，和我亲近的人一个接一个的死去\u2026\u2026种种诡异的事情导致我的精神备受折磨，让我更崩溃的是我竟怀了鬼胎，还不知道是谁的\u2026\u2026鬼夫的书友群，欢迎大家加入：304176315想了解关于文内容，更新的可以加哦！"}]
     * code : 0
     * msg : Successful
     */

    public PagerBean      pager;
    public int            code;
    public String         msg;
    public List<DataBean> data;

    public static class PagerBean {
        /**
         * total : 50
         * page : 1
         * size : 20
         */

        public int total;
        public int page;
        public int size;
    }

    public static class DataBean {
        /**
         * serial : 1
         * id : 200471
         * name : 恶少的贴身女佣
         * author : 夜雨青竹
         * cover : http://i-1.hgread.com/2017/8/10/bc5c7951-a3ae-4661-817a-d34ccc693965.jpg
         * summary : 为了逃脱家族联姻，她离家出走，却被拐卖到山村里，她逃走，又被抓回，无意间成为恶少的贴身女佣。他邪恶、过分、欠扁，还喜欢嘿嘿嘿~被出卖、被利用、被压迫、被掠夺，还要跟她抢宝宝！别以为装作不认识本姑娘，本姑娘就能饶了你！！！
         */
        public int    bookType;
        public int    serial;
        public String id;
        public String name;
        public String author;
        public String cover;
        public int    words;
        public String summary;

    }
}